In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                   index=[pd.Index(['LA','SF'], name='city')],
                   columns = pd.Index(['A','B','C','D'], name='letters'))

dframe1

letters  A  B  C  D
city
LA       0  1  2  3
SF       4  5  6  7

In [6]:
# pivot the DataFrame
dframe1_st = dframe1.stack()
dframe1_st

city  letters
LA    A          0
      B          1
      C          2
      D          3
SF    A          4
      B          5
      C          6
      D          7
dtype: int32

In [8]:
#turn the stack back to DataFrame
dframe1_st.unstack()

letters  A  B  C  D
city
LA       0  1  2  3
SF       4  5  6  7

In [9]:
#unstack only specific row
dframe1_st.unstack('city')

city     LA  SF
letters
A         0   4
B         1   5
C         2   6
D         3   7

In [10]:
# how stack/unstack handle null values

In [12]:
ser1 = Series([0,1,2], index=['Q','X','Y'])
ser2 = Series([4,5,6], index=['X','Y','Z'])

In [14]:
dframe = pd.concat([ser1,ser2], keys=['Alpha', 'Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [15]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [24]:
#remove Null values -- stack the unstacked dataframe
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [25]:
dframe = dframe.unstack()

In [26]:
#to show Null values
dframe.stack(dropna=False) #convert series to dataframe

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64